#### BuiltInFailures.KeyBasedTreeFileFailures Members

---

|  |
| --- |
| BuiltInFailures KeyBasedTreeFileFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures KeyBasedTreeFileFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotOpenFileForRead | Cannot open file [FileName]. |
| Public property Static member | CannotUnderstandAtLine | Cannot understand [EntryType] line '[Number]' |

# See Also

BuiltInFailures KeyBasedTreeFileFailures Class

Autodesk.Revit.DB Namespace